<H1>Main Page</H1>

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame(
    {
        'Name':['Krishna','Herry','Jerry','Oggy'],
        'Age': [21,32,41,28],
        'Marks':[92,94,71,84],
        'Grade':['S','S','B','A']
    }
)

In [3]:
df1

      Name  Age  Marks Grade
0  Krishna   21     92     S
1    Herry   32     94     S
2    Jerry   41     71     B
3     Oggy   28     84     A

In [4]:
df1.to_csv("modal_ago.csv")

In [5]:
df1['Attendance'] = [71,93,81,93]

In [6]:
df1

      Name  Age  Marks Grade  Attendance
0  Krishna   21     92     S          71
1    Herry   32     94     S          93
2    Jerry   41     71     B          81
3     Oggy   28     84     A          93

	Name	Age	Marks	Grade	Attendance
0	Krishna	21	92	     S	    71
1	Herry	32	94	     S	    93
2	Jerry	41	71	     B	    81
3	Oggy	28	84	     A      93

In [ ]:
df1[[df1['Name']=='Krishna' & df1['Age']<30]]['Attendance'] = 90

<H1>New Page</H1>